Revit 2027 API
BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTypeChangedToGeneric Property
 Structural Connection had an inappropriate type, which has been changed to 'Generic Connection'.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralConnectionTypeChangedToGeneric { get; }
Public Shared ReadOnly Property StructuralConnectionTypeChangedToGeneric As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralConnectionTypeChangedToGeneric {
	FailureDefinitionId^ get ();
}
static member StructuralConnectionTypeChangedToGeneric : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace